In [1]:
import pandas as pd

In [3]:
cars=pd.read_csv('c:/Users/igor/Downloads/Data-Sets-ML/usedcars.csv')
cars.head()

   year model  price  mileage   color transmission
0  2011   SEL  21992     7413  Yellow         AUTO
1  2011   SEL  20995    10926    Gray         AUTO
2  2011   SEL  19995     7351  Silver         AUTO
3  2011   SEL  17809    11613    Gray         AUTO
4  2012    SE  17500     8367   White         AUTO

In [4]:
# CHECK HOW MANY CARS BELONG TO EACH MODEL SESSION 64 CATHEGORICAL VS CONTINUOUS, USING value_counts() WE CAN KNOW KNOW IF
# IT IS CATHEGORICAL OR CONTINUOUS BASE ON NUMBER OF COUNTS
cars.model.value_counts()

SE     78
SES    48
SEL    24
Name: model, dtype: int64

In [7]:
# COUNT CAR COLOR FROM ASCENDING ORDER
cars.color.value_counts(ascending=True)

Gold       1
Yellow     3
Green      5
Gray      16
White     16
Blue      17
Red       25
Silver    32
Black     35
Name: color, dtype: int64

In [8]:
cars.year.value_counts()

2010    49
2009    42
2011    16
2008    14
2007    11
2006     6
2004     3
2000     3
2005     2
2012     1
2003     1
2002     1
2001     1
Name: year, dtype: int64

In [9]:
cars.mileage.value_counts()

7413      1
35871     1
36323     1
39211     1
44789     1
         ..
36447     1
35318     1
24929     1
23785     1
109259    1
Name: mileage, Length: 150, dtype: int64

In [13]:
cars.color.value_counts()

Black     35
Silver    32
Red       25
Blue      17
Gray      16
White     16
Green      5
Yellow     3
Gold       1
Name: color, dtype: int64

In [12]:
cars.shape

(150, 6)

In [14]:
35/150

0.23333333333333334

In [15]:
# CALCULATE PERCENTAGE OF MODEL USING NORMALIZE()
cars.color.value_counts(normalize=True)

Black     0.233333
Silver    0.213333
Red       0.166667
Blue      0.113333
Gray      0.106667
White     0.106667
Green     0.033333
Yellow    0.020000
Gold      0.006667
Name: color, dtype: float64

In [1]:
import pandas as pd

In [2]:
cars=pd.read_csv('c:/Users/igor/Downloads/Data-Sets-ML/usedcars.csv')
cars.head()

   year model  price  mileage   color transmission
0  2011   SEL  21992     7413  Yellow         AUTO
1  2011   SEL  20995    10926    Gray         AUTO
2  2011   SEL  19995     7351  Silver         AUTO
3  2011   SEL  17809    11613    Gray         AUTO
4  2012    SE  17500     8367   White         AUTO

In [4]:
# CALCULATE MIN,MAX,MEAN FOR A CAR PRICE.NB==MEAN IS AVERAGE
cars.price.min(),cars.price.max(),cars.price.mean()

(3800, 21992, 12961.933333333332)

In [5]:
# CALCULATE USING NUMPY
import numpy as np

In [6]:
np.min(cars.price),np.max(cars.price),np.mean(cars.price)

(3800, 21992, 12961.933333333332)

In [8]:
# QUANTILE AND IQR VALUE SESSION 66 AND 67 AND SESSION 68 ON ANALYSIS
iqr = cars.price.quantile(q=0.75)-cars.price.quantile(0.25)
iqr

3909.5

In [9]:
cars.price.quantile(0.25)-1.5*iqr,cars.price.quantile(q=0.75)+1.5*iqr

(5130.75, 20768.75)

In [12]:
# FIND OUTLAYER(EXTRA AND MISLEADING VALUE) OF BOTH VALUE ABOVE
cars[cars.price<5130.75]

     year model  price  mileage   color transmission
148  2001    SE   4899   151479  Yellow         AUTO
149  2000    SE   3800   109259     Red         AUTO

In [13]:
#FIND OUTLAYER(MISLEADING VALUE)
cars[cars.price>20768.75]

   year model  price  mileage   color transmission
0  2011   SEL  21992     7413  Yellow         AUTO
1  2011   SEL  20995    10926    Gray         AUTO

In [14]:
# CALCULATE STANDARD DEVIATION FOR CAR PRICE 1ER METHOD
cars.price.std()

3122.4817346856003

In [15]:
#2ND METHOD USING VARIANT
cars.price.var()**0.5

3122.4817346856003

In [16]:
# WE CAN CALCULATE ALL IN ONE USING DESCRIBE INSTEAD OF CALCULATE ONE BY ONE
cars.price.describe()

count      150.000000
mean     12961.933333
std       3122.481735
min       3800.000000
25%      10995.000000
50%      13591.500000
75%      14904.500000
max      21992.000000
Name: price, dtype: float64

In [18]:
cars[['price','mileage']].describe()

              price        mileage
count    150.000000     150.000000
mean   12961.933333   44260.646667
std     3122.481735   26982.104322
min     3800.000000    4867.000000
25%    10995.000000   27200.250000
50%    13591.500000   36385.000000
75%    14904.500000   55124.500000
max    21992.000000  151479.000000

In [19]:
# WE CAN CALCULATE PRICE AND MILEAGE AVERAGE IT MEANINGFULL FOR CONTINUOUS DATA
# BUT WE CAN NOT CALCULATE YEAR AVERAGE, IT MEANS IT IS A CATHEGORICAL DATA
cars.describe()

              year         price        mileage
count   150.000000    150.000000     150.000000
mean   2008.726667  12961.933333   44260.646667
std       2.200966   3122.481735   26982.104322
min    2000.000000   3800.000000    4867.000000
25%    2008.000000  10995.000000   27200.250000
50%    2009.000000  13591.500000   36385.000000
75%    2010.000000  14904.500000   55124.500000
max    2012.000000  21992.000000  151479.000000

In [24]:
# CARS WITH MORE THAN 10000 PRICE
cars[cars.price>10000].price.describe()

count      121.000000
mean     14150.743802
std       2027.235776
min      10717.000000
25%      12992.000000
50%      13992.000000
75%      14999.000000
max      21992.000000
Name: price, dtype: float64

In [25]:
insurance=pd.read_csv('c:/Users/igor/Downloads/Data-Sets-ML/insurance.csv')
insurance.head()

   age  gender     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [27]:
# GROUPBY MOSTLY FOR CATHEGORICAL DATA SESSION 69
insurance.groupby('gender').size()

gender
female    665
male      673
dtype: int64

In [28]:
# GROUPBY MOSTLY FOR CATHEGORICAL DATA
insurance.groupby('gender').mean()

              age        bmi  children       charges
gender
female  39.436090  30.370211  1.070677  12575.123638
male    38.980684  30.953098  1.118871  13957.455827

In [30]:
# GROUPBY AND SELECT COLUMNS
insurance[['gender','charges','bmi','children']].groupby('gender').mean()

             charges        bmi  children
gender
female  12575.123638  30.370211  1.070677
male    13957.455827  30.953098  1.118871

In [38]:
# GROUPBY AND DO CALCULCATION ONLY BASE ON NUMERIC VALUE
insurance.groupby('gender').mean(numeric_only=True)

              age        bmi  children       charges
gender
female  39.436090  30.370211  1.070677  12575.123638
male    38.980684  30.953098  1.118871  13957.455827

In [50]:
# GROUPBY AND DO CALCULCATION ONLY BASE ON NUMERIC VALUE AND CHOOSE LAST 5 VALUE
insurance.groupby('age').mean(numeric_only=True)[-5:]

           bmi  children       charges
age
60   30.332826  0.347826  21979.418507
61   32.548261  0.739130  22024.457609
62   32.342609  0.565217  19163.856573
63   31.923478  0.565217  19884.998461
64   32.976136  0.772727  23275.530837

In [53]:
insurance.groupby('smoker').describe()

           age                                                          bmi  \
         count       mean        std   min    25%   50%   75%   max   count
smoker
no      1064.0  39.385338  14.083410  18.0  26.75  40.0  52.0  64.0  1064.0
yes      274.0  38.514599  13.923186  18.0  27.00  38.0  49.0  64.0   274.0

                   ... children      charges                              \
             mean  ...      75%  max   count          mean           std
smoker             ...
no      30.651795  ...      2.0  5.0  1064.0   8434.268298   5993.781819
yes     30.708449  ...      2.0  5.0   274.0  32050.231832  11541.547176


               min           25%          50%           75%          max
smoker
no       1121.8739   3986.438700   7345.40530  11362.887050  36910.60803
yes     12829.4551  20826.244213  34456.34845  41019.207275  63770.42801

[2 rows x 32 columns]

In [59]:
# SELECT BY GROUPBY SMOKER AND CHARGES
insurance[['smoker','charges']].groupby('smoker').describe()

       charges                                                        \
         count          mean           std         min           25%
smoker
no      1064.0   8434.268298   5993.781819   1121.8739   3986.438700
yes      274.0  32050.231832  11541.547176  12829.4551  20826.244213


                50%           75%          max
smoker
no       7345.40530  11362.887050  36910.60803
yes     34456.34845  41019.207275  63770.42801

In [67]:
# SELECT BY GROUPBY SMOKER,GENDER AND CHARGES
insurance[['gender','smoker','charges']].groupby(['gender','smoker']).describe()

              charges                                                        \
                count          mean           std         min           25%
gender smoker
female no       549.0   8738.679746   6062.383200   1607.5101   4189.113100
       yes      116.0  30732.086541  11869.432421  13844.5060  19747.243325
male   no       515.0   8109.759783   5908.388013   1121.8739   3698.891250
       yes      158.0  33017.984070  11234.182693  12829.4551  21232.601338


                       50%           75%          max
gender smoker
female no       7633.72060  11741.726000  36910.60803
       yes     29045.91475  40911.257000  63770.42801
male   no       6986.69700  10962.388000  32108.66282
       yes     35835.39750  41858.343025  62592.87309